tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "superfly"

brew "azure-cli"
brew "bash"
brew "bat"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "graphviz"
brew "gnupg"
brew "hey"
brew "html-xml-utils"
brew "htop"
brew "jq"
brew "lua"
brew "luarocks"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "notmuch"
brew "pandoc"
brew "plantuml"
brew "pngcrush"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "source-highlight"
brew "speedtest-cli"
brew "telnet"
brew "terminal-notifier"
brew "thefuck"
brew "tree"
brew "tmux"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "zsh"

# fonts
cask "font-hack-nerd-font"

# 1password from mac store can't do OTP code scanning
# don't install from mac store
mas "iA Writer", id: 775737590
mas "Craft", id: 1487937127
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "LINE", id: 539883307
mas "Paprika", id: 1303222628
mas "Parcel", id: 639968404
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "Shazam", id: 897118787
mas "Tailscale", id: 1475387142
mas "TickTick", id: 966085870
