tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "azure-cli"
brew "bash"
brew "cmake"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "graphviz"
brew "hey"
brew "htop"
brew "jq"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "notmuch"
brew "pandoc"
brew "plantuml"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "telnet"
brew "terminal-notifier"
brew "thefuck"
brew "tree"
brew "tmux"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "zsh"

# fonts
cask "font-hack-nerd-font"

cask "1password-cli"
cask "aerial"
cask "audacity"
cask "audio-hijack"
cask "balenaetcher"
cask "bartender"
cask "calibre"
cask "charles"
cask "dash"
cask "discord"
cask "docker"
cask "emailchemy"
cask "evernote"
cask "firefox-developer-edition"
cask "focus"
cask "gpg-suite"
cask "hex-fiend"
cask "istat-menus"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keka"
cask "linear-linear"
cask "little-snitch"
cask "matterhorn"
cask "microsoft-teams"
cask "homebrew/cask-versions/opera-beta"
cask "plex-media-player"
cask "postgres"
cask "powershell"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "steam"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"
cask "xscreensaver"
cask "yacreader"

mas "1Password 7", id: 1333542190
mas "iA Writer", id: 775737590
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "LINE", id: 539883307
mas "Paprika Recipe Manager", id: 1303222628
mas "Parcel", id: 639968404
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "Session", id: 1521432881
mas "Shazam", id: 897118787
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
