tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "azure-cli"
brew "bash"
brew "cmake"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "graphviz"
brew "hey"
brew "htop"
brew "jq"
brew "neovim"
brew "nmap"
brew "plantuml"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "telnet"
brew "tree"
brew "tmux"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "zsh"

# fonts
cask "font-hack-nerd-font"

cask "1password-cli"
cask "charles"
cask "dash"
cask "discord"
cask "docker"
cask "focus"
cask "gpg-suite"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "keka"
cask "little-snitch"
cask "matterhorn"
cask "microsoft-teams"
cask "homebrew/cask-versions/opera-beta"
cask "postgres"
cask "powershell"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "wireshark"

mas "1Password 7", id: 1333542190
mas "iA Writer", id: 775737590
mas "LINE", id: 539883307
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "Things", id: 904280696
